In [1]:
import numpy as np
import pandas as pd

## Question 01

In [9]:
data1 = {
    'Name': ['Alice', 'Bob', np.nan, 'David'],
    'Age': [25, np.nan, 22, 28],
    'City': ['Colombo', 'Kandy', 'Galle', np.nan],
    'Civil Status' : ['Married', np.nan, 'Single', np.nan]
}

df1 = pd.DataFrame(data1)

df1

    Name   Age     City Civil Status
0  Alice  25.0  Colombo      Married
1    Bob   NaN    Kandy          NaN
2    NaN  22.0    Galle       Single
3  David  28.0      NaN          NaN

In [10]:
# a) Identify missing values
df1.isnull()

    Name    Age   City  Civil Status
0  False  False  False         False
1  False   True  False          True
2   True  False  False         False
3  False  False   True          True

In [19]:
# b) Fill missing values
df1.fillna({
    'Name': 'Unknown',
    'Age': df1['Age'].mean(),  # Mean age = (25 + 22 + 28)/3 = 25.0
    'City': 'Unknown'
}, inplace=True)

In [20]:
df1

      Name   Age     City Civil Status
0    Alice  25.0  Colombo      Married
1      Bob  25.0    Kandy          NaN
2  Unknown  22.0    Galle       Single
3    David  28.0  Unknown          NaN

In [25]:
# c) Drop rows with any missing values
df1.dropna()

      Name   Age     City Civil Status
0    Alice  25.0  Colombo      Married
2  Unknown  22.0    Galle       Single

## Question 02

In [27]:
data2 = {
    'ID': [1, 2, 3, 3, 4, 5, 5],
    'Name': ['A', 'B', 'C', 'C', 'D', 'E', 'E']
}
df2 = pd.DataFrame(data2)
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   3    C
4   4    D
5   5    E
6   5    E

In [31]:
# a) Detect duplicate rows
print(f"These are :")
print(df2.duplicated())
duplicates = df2[df2.duplicated()]
duplicates

These are :
0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

   ID Name
3   3    C
6   5    E

In [33]:
# b) Remove duplicate rows
print(f"These are :")
print(df2.drop_duplicates())
df2_unique = df2.drop_duplicates()
df2_unique

These are :
   ID Name
0   1    A
1   2    B
2   3    C
4   4    D
5   5    E

   ID Name
0   1    A
1   2    B
2   3    C
4   4    D
5   5    E

## Question 03

In [34]:
data3 = {
    'ID': ['101', '102', '103'],
    'JoinDate': ['2022-01-10', '2022-02-15', '2022-03-01'],
    'Salary': ['50000', '60000', '70000']
}
df3 = pd.DataFrame(data3)
df3

    ID    JoinDate Salary
0  101  2022-01-10  50000
1  102  2022-02-15  60000
2  103  2022-03-01  70000

In [35]:
# Convert to appropriate data types
df3['ID'] = df3['ID'].astype(int)
df3['JoinDate'] = pd.to_datetime(df3['JoinDate'])
df3['Salary'] = df3['Salary'].astype(float)

df3

    ID   JoinDate   Salary
0  101 2022-01-10  50000.0
1  102 2022-02-15  60000.0
2  103 2022-03-01  70000.0

In [46]:
data4 = {
    'Product': [' Apple ', 'BaNaNa', '  Cherry', 'DaTE ']
}
df4 = pd.DataFrame(data4)
print(f"Length of 'Apple' word : {len(df4['Product'][0])}")
df4

Length of 'Apple' word : 7

    Product
0    Apple
1    BaNaNa
2    Cherry
3     DaTE

In [48]:
# a) Remove extra spaces
print(f"Length of 'Apple' word : {len(df4['Product'][0])}")
df4['Product'] = df4['Product'].str.strip()
df4

Length of 'Apple' word : 5

  Product
0   Apple
1  BaNaNa
2  Cherry
3    DaTE

## Question 05

In [49]:
data5 = {
    'Score': [55, 60, 62, 90, 95, 200, 58, 59, 210]
}
df5 = pd.DataFrame(data5)
df5

   Score
0     55
1     60
2     62
3     90
4     95
5    200
6     58
7     59
8    210

In [53]:
# a) Detect values greater than a threshold (e.g., >100)
outliers = df5[df5['Score'] > 100]
outliers

   Score
5    200
8    210

In [55]:
# b) Replace outliers with mean of non-outliers
mean_score = df5[df5['Score'] <= 100]['Score'].mean()  # = 68.428571
df5['Score'] = df5['Score'].apply(lambda x: mean_score if x > 100 else x)
df5

       Score
0  55.000000
1  60.000000
2  62.000000
3  90.000000
4  95.000000
5  68.428571
6  58.000000
7  59.000000
8  68.428571